import java.util.Collection;
import java.util.List;

//В университете есть несколько факультетов, в которых учатся студенты, объединенные в группы.
// У каждого студента есть несколько учебных предметов по которым он получает оценки.
// Необходимо реализовать иерархию студентов, групп и факультетов.
//        •	Посчитать средний балл по всем предметам студента
//        •	Посчитать средний балл по конкретному предмету в конкретной группе и на конкретном факультете
//        •	Посчитать средний балл по предмету для всего университета


public class ManagementSystem {
    private List<Faculty> faculties;
    private List<Group> groups;
    private Collection<Student> students;


}
